<a href="https://colab.research.google.com/github/dafeng097/info5731/blob/master/Pandas_Solution_of_chapter23.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# run in pandas

## convert data

In [0]:
class Table:
  def __init__(self, columns):
    self.columns = columns
    self.rows = []
  def __repr__(self):
    return str(self.columns) + "\n" + "\n".join(map(str, self.rows))
  def insert(self, row_values):
    if len(row_values) != len(self.columns):
      raise TypeError("Wrong number of Elements!")
    row_dict = dict(zip(self.columns, row_values))
    self.rows.append(row_dict)

In [0]:
users = Table(["user_id", "name", "num_friends"])
users.insert([0, "Hero", 0])
users.insert([1, "Dunn", 2])
users.insert([2, "Sue", 3])
users.insert([3, "Chi", 3])
users.insert([4, "Thor", 3])
users.insert([5, "Clive", 2])
users.insert([6, "Hicks", 3])
users.insert([7, "Devin", 2])
users.insert([8, "Kate", 2])
users.insert([9, "Klein", 3])
users.insert([10, "Jen", 1])

In [0]:
user_interests = Table(["user_id", "interest"])
user_interests.insert([0, "SQL"])
user_interests.insert([0, "NoSQL"])
user_interests.insert([2, "SQL"])
user_interests.insert([2, "MySQL"])

In [0]:
import pandas as pd

In [0]:
df_users = pd.DataFrame(users.rows)
df_users = df_users[['user_id', 'name', 'num_friends']]
df_users

    user_id   name  num_friends
0         0   Hero            0
1         1   Dunn            2
2         2    Sue            3
3         3    Chi            3
4         4   Thor            3
5         5  Clive            2
6         6  Hicks            3
7         7  Devin            2
8         8   Kate            2
9         9  Klein            3
10       10    Jen            1

In [0]:
df_users.to_csv("users.csv", index=False)

In [0]:
df_interests = pd.DataFrame(user_interests.rows)
df_interests = df_interests[['user_id', "interest"]]
df_interests

   user_id interest
0        0      SQL
1        0    NoSQL
2        2      SQL
3        2    MySQL

In [0]:
df_interests.to_csv("interests.csv", index=False)

## insert

In [0]:
df = df_users.copy()

In [0]:
df.loc[11] = [11, 'Shuyi', 5]

In [0]:
df

    user_id   name  num_friends
0         0   Hero            0
1         1   Dunn            2
2         2    Sue            3
3         3    Chi            3
4         4   Thor            3
5         5  Clive            2
6         6  Hicks            3
7         7  Devin            2
8         8   Kate            2
9         9  Klein            3
10       10    Jen            1
11       11  Shuyi            5

In [0]:
new_row = pd.DataFrame([[11, 'Shuyi', 5]], columns=df.columns); new_row

   user_id   name  num_friends
0       11  Shuyi            5

In [0]:
df = pd.concat([df, new_row]).reset_index(drop=True); df

## update

In [0]:
df.loc[11, 'name'] = 'Wang'; df

    user_id   name  num_friends
0         0   Hero            0
1         1   Dunn            2
2         2    Sue            3
3         3    Chi            3
4         4   Thor            3
5         5  Clive            2
6         6  Hicks            3
7         7  Devin            2
8         8   Kate            2
9         9  Klein            3
10       10    Jen            1
11       11   Wang            5

In [0]:
df.loc[df[df.name=="Shuyi"].index, 'name'] = 'Wang'; df

## delete

In [0]:
df.drop(11)

    user_id   name  num_friends
0         0   Hero            0
1         1   Dunn            2
2         2    Sue            3
3         3    Chi            3
4         4   Thor            3
5         5  Clive            2
6         6  Hicks            3
7         7  Devin            2
8         8   Kate            2
9         9  Klein            3
10       10    Jen            1

In [0]:
df[df.name=='Wang']

In [0]:
df.drop(df[df.name=='Wang'].index, inplace=True)

In [0]:
df

## select

In [0]:
df[['user_id', 'name']]

In [0]:
df[['name', 'num_friends']]

     name  num_friends
0    Hero            0
1    Dunn            2
2     Sue            3
3     Chi            3
4    Thor            3
5   Clive            2
6   Hicks            3
7   Devin            2
8    Kate            2
9   Klein            3
10    Jen            1
11   Wang            5

In [0]:
df['name_length'] = df.name.apply(len); df

## where & limit

In [0]:
df[df['name']=='Dunn'][['user_id']]

In [0]:
df.head(2)

## group by

In [0]:
grouped = df.groupby(['name_length']); grouped

In [0]:
grouped.groups

In [0]:
for name, group in grouped:
  print(name)
  print(group)

In [0]:
grouped['user_id'].agg(['min', 'count'])

In [0]:
df

In [0]:
df['first_letter'] = df.name.apply(lambda x: x[0])

In [0]:
df

In [0]:
new_df = df.groupby(['first_letter'])[['num_friends']].agg('mean'); new_df

In [0]:
new_df.columns = ['avg_num_friends']; new_df

In [0]:
new_df[new_df.avg_num_friends > 1]

## order by

In [0]:
df = df_users.copy(); df

In [0]:
df.sort_values(by=['name'])

## join

In [0]:
df = df_users.copy(); df

In [0]:
df_interests

In [0]:
df.join(df_interests.set_index('user_id'), on=['user_id'], how='inner')[['name', 'interest']]

In [0]:
df.join(df_interests.set_index('user_id'), on=['user_id'], how='left').groupby('name')[['interest']].agg(['count'])